app/controllers/events_controller.rb

INSERT INTO "events" ("event_name", "description", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "Now add the association between the event attendee (also a User) and the event. "], ["updated_at", "2020-08-27 22:18:08.350348"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)