app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Private 2nd edition"], ["updated_at", "2020-08-19 21:42:54.359357"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)